andrewhw/emgsim/c++/src/tlSrString.cpp
/**
 * Copyright (c) 2013
 * All rights reserved.
 *
 * This code is part of the reseach work of
 * Andrew Hamilton-Wright (andrewhw@ieee.org).
 *
 * ----------------------------------------------------------------
 *
 * Redistribution and use in source and binary forms, with or with-
 * out modification, are permitted provided that recognition of the
 * author as the original contributor is provided in any source or
 * documentation relating to this code.
 *
 * THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WAR-
 * RANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.
 *
 * IN NO EVENT SHALL THE AUTHOR OR ANY ASSOCIATED INSTITUTION BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
 * OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PRO-
 * CUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
 * PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR
 * TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
 * OF SUCH DAMAGE.
 *
 * $Id: tlSrString.cpp 57 2013-12-13 21:33:01Z andrew $
 */


#ifndef MAKEDEPEND
# include <stdlib.h>
# include <string.h>
# include <stdarg.h>
# include <ctype.h>
#endif

#include "os_defs.h"
#include "tclCkalloc.h"
#include "listalloc.h"
#include "stringtools.h"

#include "tlSrString.h"


#define				MAX_NUMBER_LENGTH		128

#define FORMAT_TYPE_NOTYPE				0x01
#define FORMAT_TYPE_FLOAT				0x02
#define FORMAT_TYPE_DECIMAL				0x03
#define FORMAT_TYPE_OCTAL				0x04
#define FORMAT_TYPE_HEX						0x05
#define FORMAT_TYPE_STRING				0x06
#define FORMAT_TYPE_CHAR				0x07
#define FORMAT_TYPE_POINTER				0x08
#define FORMAT_TYPE_PERCENT				0x09


#define		DTYPE_NOTYPE						0x01
#define DTYPE_INTEGER						0x02
#define DTYPE_UNSIGNED						0x03
#define DTYPE_DOUBLE						0x04
#define DTYPE_CHAR						0x05
#define DTYPE_STRING						0x06
#define DTYPE_TL_STRING						0x07
#define DTYPE_POINTER						0x08

// output flags to control pretty printing
#define OFLAG_CLEAR						0x0000
#define OFLAG_PAD_ZERO						0x0001
#define OFLAG_LEFT_JUST						0x0002
#define OFLAG_FORCE_SIGN				0x0004
#define OFLAG_SPACE_SIGN				0x0008
#define OFLAG_UPPERCASE						0x0010
#define OFLAG_EXPONENT						0x0020
#define OFLAG_VAREXP						0x0040
#define OFLAG_HAS_PREC						0x0080
#define OFLAG_USE_ALTERNATE				0x0100
#define OFLAG_WIDTH_LOADED				0x0200
#define OFLAG_PREC_LOADED				0x0400
#define OFLAG_BAD_FORMAT				0x8000

    // types of storage size specification
#define STFLAG_CLEAR						0x01
#define STFLAG_IS_LONG						0x02
#define STFLAG_IS_LONG_LONG				0x03
#define STFLAG_IS_SHORT						0x04


typedef struct SpecifierDescription
{
		int width_;
		int precision_;
		int frmtType_;
		int dataType_;
		int storageSpec_;
		int outFlags_;
} SpecifierDescription;

typedef struct OutputBuffer
{
		char *buffer_;
		int length_;
		int blocks_;
} OutputBuffer;


/** access for static global "nil" string */
tlSrString tlSrString::nil("");

#ifdef		TL_UNICODE
const tlUNICODE tlSrString::sUnicodeUnknown_[] = {
    				0x00, 'u',
    				0x00, 'n',
    				0x00, 'k',
    				0x00, 'n',
    				0x00, 'o',
    				0x00, 'w',
    				0x00, 'n',
    				0x00, 0x00
    		};
#endif

void
tlSrString::sExitCleanup()
{
#ifdef		OS_WINDOWS_NT
# ifdef OS_WINDOWS_DELETE_NIL
	if (tlSrString::nil.data_ != NULL)
	{
		/**
		 * This is protected as on MFC programs it is difficult
		 * to determine whether or not sExitCleanup may be
		 * being called _after_ the nil string cleanup that
		 * occurs statically may already be done.  See also
		 * the "set to null" in tlSrString's destructor that
		 * is only required to maintain this if statement.
		 */
		tlSrString::nil.data_->unref();
	}
# endif
#else
	tlSrString::nil.data_->unref();
#endif
	tlSrString::nil.data_ = NULL;
}

tlSrString::tlSrString(const char *s)
{
	data_ = new tlString_(s);
	MSG_ASSERT(data_ != NULL, "Out of memory");
	if (data_ != NULL)
	{
		data_->ref();
	}
}

tlSrString::tlSrString(const tlSrString &sibling)
{
	if (sibling.data_ != NULL)
		++sibling.data_->refCount_;
	data_ = sibling.data_;
}

tlSrString::tlSrString()
{
	if (nil.data_ != NULL)
		++nil.data_->refCount_;
	data_ = nil.data_;
}

tlSrString::~tlSrString()
{
	if (data_ != NULL)
	{
		data_->unref();
#ifdef OS_WINDOWS_NT
		data_ = NULL;
#endif
	}
}

tlSrString &
tlSrString::operator= (const tlSrString &sibling)
{
	if (sibling.data_ != NULL)
		++sibling.data_->refCount_;

	if (data_ != NULL)
	{
		data_->unref();
	}
	data_ = sibling.data_;

	return *this;
}

int
operator== (
		const tlSrString &s1,
		const tlSrString &s2
    )
{
	if (s1.data_ == s2.data_)
		return 1;
	return !strcmp(s1.data_->s_, s2.data_->s_);
}

int
operator!= (
		const tlSrString &s1,
		const tlSrString &s2
    )
{
	if (s1.data_ == s2.data_)
		return 0;
	return strcmp(s1.data_->s_, s2.data_->s_);
}

int
operator>= (
		const tlSrString &s1,
		const tlSrString &s2
    )
{
	int result;
	if (s1.data_ == s2.data_)
		return 1;
	result = strcmp(s1.data_->s_, s2.data_->s_);
	if (result >= 0)
		return 1;
	return 0;
}

int
operator<= (
		const tlSrString &s1,
		const tlSrString &s2
    )
{
	int result;
	if (s1.data_ == s2.data_)
		return 1;
	result = strcmp(s1.data_->s_, s2.data_->s_);
	if (result <= 0)
		return 1;
	return 0;
}

int
operator> (
		const tlSrString &s1,
		const tlSrString &s2
    )
{
	int result;
	if (s1.data_ == s2.data_)
		return 0;
	result = strcmp(s1.data_->s_, s2.data_->s_);
	if (result > 0)
		return 1;
	return 0;
}

int
operator< (
		const tlSrString &s1,
		const tlSrString &s2
    )
{
	int result;
	if (s1.data_ == s2.data_)
		return 0;
	result = strcmp(s1.data_->s_, s2.data_->s_);
	if (result < 0)
		return 1;
	return 0;
}

tlSrString
operator+ (
		const tlSrString &s1,
		const tlSrString &s2
    )
{
	tlSrString result;
	result.sprintf("%s%s", s1.getValue(), s2.getValue());
	return result;
}


tlSrString &
tlSrString::operator+= (const tlSrString &sibling)
{
	this->sprintf("%s%s", this->getValue(), sibling.getValue());

	return *this;
}

tlSrString &
tlSrString::operator+= (const char *moreData)
{
	this->sprintf("%s%s", this->getValue(), moreData);

	return *this;
}

