andrewhw/emgsim/c++/src/tlSrString.cpp
/** ---------------------------------------------------------------- */
int
operator== (
		const tlSrString &s1,
		const char *s2
    )
{
	return !strcmp(s1.data_->s_, s2);
}

int
operator!= (
		const tlSrString &s1,
		const char *s2
    )
{
	return strcmp(s1.data_->s_, s2);
}

int
operator>= (
		const tlSrString &s1,
		const char *s2
    )
{
	int result;
	result = strcmp(s1.data_->s_, s2);
	if (result >= 0)
		return 1;
	return 0;
}

int
operator<= (
		const tlSrString &s1,
		const char *s2
    )
{
	int result;
	result = strcmp(s1.data_->s_, s2);
	if (result <= 0)
		return 1;
	return 0;
}

int
operator> (
		const tlSrString &s1,
		const char *s2
    )
{
	int result;
	result = strcmp(s1.data_->s_, s2);
	if (result > 0)
		return 1;
	return 0;
}

int
operator< (
		const tlSrString &s1,
		const char *s2
    )
{
	int result;
	result = strcmp(s1.data_->s_, s2);
	if (result < 0)
		return 1;
	return 0;
}

tlSrString
operator+ (
		const tlSrString &s1,
		const char *s2
    )
{
	tlSrString result;
	result.sprintf("%s%s", s1.getValue(), s2);
	return result;
}

tlSrString::tlString_::tlString_(const char *s)
{
	s_ = ckstrdup(s);
	sLen_ = strlen(s_);

#ifdef		TL_UNICODE
	u_ = tlUTFToUnicode(s);
	uLen_ = tlUnicodeStrlen(u_);
#endif
}

tlSrString::tlString_::tlString_(const char *s, int max)
{
	s_ = ckstrndup(s, max);
	sLen_ = strlen(s_);

#ifdef		TL_UNICODE
	u_ = tlUTFToUnicode(s);
	uLen_ = tlUnicodeStrlen(u_);
#endif
}

#ifdef		TL_UNICODE
tlSrString::tlString_::tlString_(const tlUNICODE *u)
{
	uLen_ = tlUnicodeStrlen(u);
	u_ = (tlUNICODE *) ckalloc(sizeof(tlUNICODE) * (uLen_ + 1));
	memcpy(u_, u, uLen_);

	s_ = tlUnicodeToUTF(u);
	sLen_ = strlen(s_);
}
#endif

tlSrString::tlString_::~tlString_()
{
	if (s_ != NULL)
		ckfree(s_);

#ifdef		TL_UNICODE
	if (u_ != NULL)
		ckfree(u_);
#endif
}

void
tlSrString::setValue(const char *s)
{
	if (data_ != NULL)
	{
		data_->unref();
	}

	data_ = new tlString_(s);
	MSG_ASSERT(data_ != NULL, "Out of memory");
	if (data_ != NULL)
	{
		data_->ref();
	}
}

void
tlSrString::setValueMaxLen(const char *s, int maxLen)
{
	if (data_ != NULL)
	{
		data_->unref();
	}

	data_ = new tlString_(s, maxLen);
	MSG_ASSERT(data_ != NULL, "Out of memory");
	if (data_ != NULL)
	{
		data_->ref();
	}
}

#ifdef		TL_UNICODE
void
tlSrString::setValue(const tlUNICODE *u)
{
	if (data_ != NULL)
	{
		data_->unref();
	}

	data_ = new tlString_(u);
	MSG_ASSERT(data_ != NULL, "Out of memory");
	if (data_ != NULL)
	{
		data_->ref();
	}
}

const tlUNICODE
tlSrString::operator[] (int index)
{
//    if ((index >= 0) && (index < data_->uLen_))
//		return data_->u_[index];

	if ((index >= 0) && (index < data_->sLen_))
		return data_->s_[index];

	return 0;
}
#endif


/**
 * this function gets called right after we saw a '%' sign, so we now
 * have to figure out what the specifier is actually about
 *
 * Here we build up the SpecifierDescription specifier, from which we
 * can simply print out all the output info.
 */
static int
parseFormatSpecifier(
		const char *format,
		SpecifierDescription *specifier
    )
{
	int leaveLoop = 0;
	int sawDigit = 0;
	int lengthRead = 1;
	/** we will always convert at least one character **/


	/**
	 * Set flags for no data
	 */
	specifier->outFlags_ = OFLAG_CLEAR;
	specifier->width_ = 0;
	specifier->precision_ = 0;
	specifier->dataType_ = DTYPE_NOTYPE;
	specifier->frmtType_ = FORMAT_TYPE_NOTYPE;
	specifier->storageSpec_ = STFLAG_CLEAR;

	while (*format != '\0')
	{
		if (isascii(*format))
		{
			/**
			 **		actual format specifiers
			 **/
			switch(*format)
			{
			case 'd':
			case 'i':
				specifier->frmtType_ = FORMAT_TYPE_DECIMAL;
				specifier->dataType_ = DTYPE_INTEGER;
				leaveLoop = 1;
				break;


			case 'o':
				specifier->frmtType_ = FORMAT_TYPE_OCTAL;
				specifier->dataType_ = DTYPE_UNSIGNED;
				leaveLoop = 1;
				break;

			case 'u':
				specifier->frmtType_ = FORMAT_TYPE_DECIMAL;
				specifier->dataType_ = DTYPE_UNSIGNED;
				leaveLoop = 1;
				break;

			case 'X':
				specifier->outFlags_ |= OFLAG_UPPERCASE;
				/** fall through **/
			case 'x':
				specifier->frmtType_ = FORMAT_TYPE_HEX;
				specifier->dataType_ = DTYPE_UNSIGNED;
				leaveLoop = 1;
				break;

			case 'f':
				specifier->frmtType_ = FORMAT_TYPE_FLOAT;
				specifier->dataType_ = DTYPE_DOUBLE;
				leaveLoop = 1;
				break;

			case 'E':
				specifier->outFlags_ |= OFLAG_UPPERCASE;
				/** fall through **/
			case 'e':
				specifier->frmtType_ = FORMAT_TYPE_FLOAT;
				specifier->dataType_ = DTYPE_DOUBLE;
				specifier->outFlags_ = OFLAG_EXPONENT;
				leaveLoop = 1;
				break;

			case 'G':
				specifier->outFlags_ |= OFLAG_UPPERCASE;
				/** fall through **/
			case 'g':
				specifier->frmtType_ = FORMAT_TYPE_FLOAT;
				specifier->dataType_ = DTYPE_DOUBLE;
				specifier->outFlags_ |= OFLAG_VAREXP;
				leaveLoop = 1;
				break;

			case 'c':
				specifier->frmtType_ = FORMAT_TYPE_CHAR;
				specifier->dataType_ = DTYPE_CHAR;
				leaveLoop = 1;
				break;

			case 's':
				specifier->frmtType_ = FORMAT_TYPE_STRING;
				specifier->dataType_ = DTYPE_STRING;
				leaveLoop = 1;
				break;

			case 'S':
				specifier->frmtType_ = FORMAT_TYPE_STRING;
				specifier->dataType_ = DTYPE_TL_STRING;
				leaveLoop = 1;
				break;

			case 'p':
				specifier->frmtType_ = FORMAT_TYPE_POINTER;
				specifier->dataType_ = DTYPE_POINTER;
				leaveLoop = 1;
				break;

			case '%':
				specifier->frmtType_ = FORMAT_TYPE_PERCENT;
				leaveLoop = 1;
				break;


			/**
			 **		size modifiers
			 **/
			case 'h':
				if (specifier->storageSpec_ != STFLAG_CLEAR)
					specifier->outFlags_ = OFLAG_BAD_FORMAT;
				specifier->storageSpec_ = STFLAG_IS_SHORT;
				break;

			case 'l':		/** and 'll'		*/
				if (specifier->storageSpec_ == STFLAG_IS_LONG)
					specifier->storageSpec_ = STFLAG_IS_LONG_LONG;
				else
					specifier->storageSpec_ = STFLAG_IS_LONG;
				break;


			/**
			 **		flag modifiers
			 **/
			case '-':
				specifier->outFlags_ |= OFLAG_LEFT_JUST;
				break;

			case '+':
				specifier->outFlags_ |= OFLAG_FORCE_SIGN;
				if (specifier->outFlags_ & OFLAG_SPACE_SIGN)
					specifier->outFlags_ &= ~(OFLAG_SPACE_SIGN);
				break;

			case ' ':
				if (!(specifier->outFlags_ & OFLAG_FORCE_SIGN))
					specifier->outFlags_ |= OFLAG_SPACE_SIGN;
				break;

