andrewhw/emgsim/c++/src/tlSrString.cpp
			case '#':
				specifier->outFlags_ |= OFLAG_USE_ALTERNATE;
				break;

			case '0':
				if (sawDigit == 0)
				{
					specifier->outFlags_ |= OFLAG_PAD_ZERO;
				} else
				{
					/** load up one of the integer based fields **/
					if (!(specifier->outFlags_ & OFLAG_HAS_PREC))
					{
						specifier->width_ = (specifier->width_ * 10);
					} else
					{
						specifier->precision_ =
									(specifier->precision_ * 10);
					}
				}
				sawDigit = 1;
				break;


			case '.':
				specifier->outFlags_ |= OFLAG_HAS_PREC;
				break;

			case '*':		/** load sizes from stack **/
				if (!(specifier->outFlags_ & OFLAG_HAS_PREC))
				{
					specifier->outFlags_ |= OFLAG_WIDTH_LOADED;
				} else
				{
					specifier->outFlags_ |= OFLAG_PREC_LOADED;
				}
				break;


			/**
			 **		flag modifiers
			 **/
			default:
				/** we handle zeros above, but other digits here */
				if (isdigit(*format))
				{
					sawDigit = 1;
					/** load up one of the integer based fields **/
					if (!(specifier->outFlags_ & OFLAG_HAS_PREC))
					{
						specifier->width_ = (specifier->width_ * 10) +
							(*format - '0');
					} else
					{
						specifier->precision_ =
									(specifier->precision_ * 10) +
								(*format - '0');
					}

				} else
				{
					/** flag bad on through on unknown chars **/
					specifier->outFlags_ = OFLAG_BAD_FORMAT;
				}
				break;
			}

			if (leaveLoop)
				break;

		} else
		{
			/**
			 * if we don't understand something,
			 * flag this format as bad
			 */
			specifier->outFlags_ = OFLAG_BAD_FORMAT;
		}
		format++;
		lengthRead++;
	}

	if (*format == '\0')
	{
		specifier->outFlags_ = OFLAG_BAD_FORMAT;
	}

	/** check that default precision is 6 for float **/
	if ((specifier->frmtType_ == FORMAT_TYPE_FLOAT) &&
				(!(specifier->outFlags_ & OFLAG_HAS_PREC)))
	{
		specifier->precision_ = 6;
	}

	return lengthRead;
}


static void
addCharToOutputBuffer(OutputBuffer *buf, char c)
{
	int status;
	
	status = listCheckSize(
				buf->length_ + 2,
				(void **) &buf->buffer_,
				&buf->blocks_,
				64,
				sizeof(char));
	MSG_ASSERT(status, "Out of memory");
	buf->buffer_[ buf->length_++ ] = c;
	buf->buffer_[ buf->length_ ] = 0;
}

static void
addRepeatCharToOutputBuffer(OutputBuffer *buf, char c, int n)
{
	int status, i;

	/** grow the buffer enough for the whole string we are adding */
	status = listCheckSize(
				buf->length_ + n + 1,
				(void **) &buf->buffer_,
				&buf->blocks_,
				64,
				sizeof(char));
	MSG_ASSERT(status, "Out of memory");

	/**
	 * add in n chars & update the length
	 */
	for (i = 0; i < n ; i++)
	{
		buf->buffer_[ buf->length_++] = c;
	}
	buf->buffer_[ buf->length_ ] = 0;
}

static void
addStringToOutputBuffer(OutputBuffer *buf, const char *dataString)
{
	int length, status;
	
	length = strlen(dataString);

	/** grow the buffer enough for the whole dataString we are adding */
	status = listCheckSize(
				buf->length_ + length + 1,
				(void **) &buf->buffer_,
				&buf->blocks_,
				64,
				sizeof(char));
	MSG_ASSERT(status, "Out of memory");

	/** copy in the new dataString and update the length */
	memcpy(&buf->buffer_[ buf->length_ ], dataString, length);
	buf->buffer_[ buf->length_ + length ] = 0;
	buf->length_ += length;
}

// load from a local buffer into the string with padding
static void
loadFromBuffer(
		OutputBuffer *outputBufState,
		const char *localLoad,
		int nPrinted,
		SpecifierDescription *specifierDescription
    )
{
	int		nPad;
	int isPrinted = 0;

	/** add spaces to the buffer **/
	nPad = specifierDescription->width_ - nPrinted;
	if (nPad > 0)
	{
		if (specifierDescription->outFlags_ & OFLAG_LEFT_JUST)
		{
			addStringToOutputBuffer(outputBufState, localLoad);
			isPrinted = 1;
		}
		if (specifierDescription->outFlags_ & OFLAG_PAD_ZERO)
		{
			addRepeatCharToOutputBuffer(outputBufState, '0', nPad);
		} else
		{
			addRepeatCharToOutputBuffer(outputBufState, ' ', nPad);
		}
	}

	if (!isPrinted)
		addStringToOutputBuffer(outputBufState, localLoad);
}

static void
loadInteger(
		OutputBuffer *outputBufState,
		int iVal,
		SpecifierDescription *specifierDescription
    )
{
	int nPrinted = 0;
	int nPad;
	int isNeg = 0;
	char localBuf[MAX_NUMBER_LENGTH];
	char *localLoad;

	/** set up the temp buffer to load from the right **/
	localLoad = &localBuf[MAX_NUMBER_LENGTH - 1];
	*localLoad-- = 0;

	if (iVal < 0)
	{
		isNeg = 1;
		iVal *= (-1);
	}

	/** fill up the buffer **/
	while (iVal > 0)
	{
		*localLoad-- = (char) ('0' + (iVal % 10));
		iVal /= 10;
		nPrinted++;
	}

	/** add in precision **/
	if ((specifierDescription->outFlags_ & OFLAG_HAS_PREC) != 0)
	{
		if (nPrinted < specifierDescription->precision_)
		{
			specifierDescription->precision_ -= nPrinted;
			while (specifierDescription->precision_-- > 0)
			{
				*localLoad-- = '0';
				nPrinted++;
			}
		}
	}

	/** check for 0 value **/
	if (nPrinted == 0)
	{
		*localLoad-- = '0';
		nPrinted++;
	}

	/**
	 ** we have to determine whether we are padding with zeros
	 ** prior to committing to the sign
	 **/
	if (specifierDescription->outFlags_ & OFLAG_PAD_ZERO)
	{
		nPad = (specifierDescription->width_ - nPrinted) - 1;
		while (nPad-- > 0)
		{
			*localLoad-- = '0';
			nPrinted++;
		}
	}

	/** handle the sign **/
	if (isNeg)
	{
		*localLoad-- = '-';
		nPrinted++;

	} else if (specifierDescription->outFlags_ & OFLAG_FORCE_SIGN)
	{
		*localLoad-- = '+';
		nPrinted++;

	} else if (specifierDescription->outFlags_ & OFLAG_SPACE_SIGN)
	{
		*localLoad-- = ' ';
		nPrinted++;
	}

	/**
	 * we have backed up one too many chars, so pre-increment
	 * localLoad
	 */
	loadFromBuffer(
			outputBufState,
			++localLoad,
			nPrinted,
			specifierDescription
		);
}

static void
loadUnsigned(
		OutputBuffer *outputBufState,
		unsigned uVal,
		SpecifierDescription *specifierDescription
    )
{
	int nPrinted = 0;
	int outBase;
	int alternateOk = 0;
	char localBuf[MAX_NUMBER_LENGTH];
	char *localLoad;
	const char *outChars;

	/** set up the temp buffer **/
	localLoad = &localBuf[MAX_NUMBER_LENGTH - 1];
	*localLoad-- = 0;

	/** figure out our base **/
	if (specifierDescription->frmtType_ == FORMAT_TYPE_HEX)
	{

		outBase = 16;
		alternateOk = 1;
		if (specifierDescription->outFlags_ & OFLAG_UPPERCASE)
			outChars = "0123456789ABCDEFX";
		else
			outChars = "0123456789abcdefx";

