andrewhw/emgsim/c++/src/tlSrString.cpp
	} else if (specifierDescription->frmtType_ == FORMAT_TYPE_OCTAL)
	{
		alternateOk = 1;
		outBase = 8;
		outChars = "01234567";

	} else
	{
		outBase = 10;
		outChars = "0123456789";
	}
	

	/** fill up the buffer **/
	while (uVal > 0)
	{
		*localLoad-- = outChars[0 + (uVal % outBase)];
		uVal /= outBase;
		nPrinted++;
	}

	/** add in precision **/
	if (specifierDescription->outFlags_ & OFLAG_HAS_PREC)
	{
		if (nPrinted < specifierDescription->precision_)
		{
			specifierDescription->precision_ -= nPrinted;
			while (specifierDescription->precision_-- > 0)
			{
				*localLoad-- = '0';
				nPrinted++;
			}
		}
	}

	/** check for 0 value **/
	if (nPrinted == 0)
	{
		alternateOk = 0;
		*localLoad-- = '0';
		nPrinted++;
	}

	/** handle the leader if there **/
	if ((alternateOk) &&
					(specifierDescription->outFlags_
								& OFLAG_USE_ALTERNATE))
	{
		if (specifierDescription->frmtType_ == FORMAT_TYPE_HEX)
		{
			*localLoad-- = outChars[outBase];
			nPrinted++;
		}
		*localLoad-- = '0';
		nPrinted++;
	}

	loadFromBuffer(
			outputBufState,
			++localLoad,
			nPrinted,
			specifierDescription
		);
}

static void
loadDouble(
		OutputBuffer *outputBufState,
		double dVal,
		SpecifierDescription *specifierDescription
    )
{
	int nPrinted = 0;
	int nPad;
	int isNeg = 0;
	const char *fmt;
	char localFormatBuf[MAX_NUMBER_LENGTH];
	char localPadBuf[2 * MAX_NUMBER_LENGTH];
	char *localLoad;

	if (dVal < 0.0)
	{
		isNeg = 1;
		dVal *= (-1);
	}

	/**
	 ** set up the temp buffer -- we may as well not figure out this
	 **		horrible thing all over again!
	 **/
	if (specifierDescription->outFlags_ & OFLAG_EXPONENT)
	{
		fmt = "%.*e";

	} else if (specifierDescription->outFlags_ & OFLAG_VAREXP)
	{
		fmt = "%.*g";

	} else
	{
		fmt = "%.*f";
	}

	/** first print it based on type */
	slnprintf(localFormatBuf, MAX_NUMBER_LENGTH, fmt,
					specifierDescription->precision_, dVal);

	/**
	 * now move to the right-most location in the buffer
	 * so that we can pad it
	 */
	nPrinted = strlen(localFormatBuf);
	localLoad = &localPadBuf[(2 * MAX_NUMBER_LENGTH) - (nPrinted + 1)];
	strlcpy(localLoad, localFormatBuf, nPrinted+1);
	localLoad--;


	/**
	 * we have to determine whether we are padding with zeros
	 * prior to committing to the sign
	 */
	if (specifierDescription->outFlags_ & OFLAG_PAD_ZERO)
	{
		nPad = (specifierDescription->width_ - nPrinted) - 1;
		while (nPad-- > 0)
		{
			*localLoad-- = '0';
			nPrinted++;
		}
	}

	/** handle the sign **/
	if (isNeg)
	{
		*localLoad-- = '-';
		nPrinted++;

	} else if (specifierDescription->outFlags_ & OFLAG_FORCE_SIGN)
	{
		*localLoad-- = '+';
		nPrinted++;

	} else if (specifierDescription->outFlags_ & OFLAG_SPACE_SIGN)
	{
		*localLoad-- = ' ';
		nPrinted++;
	}

	loadFromBuffer(
			outputBufState,
			++localLoad,
			nPrinted,
			specifierDescription
		);
}

static void
loadChar(
		OutputBuffer *outputBufState,
		char c,
		SpecifierDescription *specifierDescription
    )
{
	int		isPrinted = 0;

	if (specifierDescription->width_ != 0)
	{
		if (specifierDescription->outFlags_ & OFLAG_LEFT_JUST)
		{
			addCharToOutputBuffer(outputBufState, c);
			isPrinted = 1;
		}
		/** print out specified width field **/
		addRepeatCharToOutputBuffer(
				outputBufState, ' ',
				specifierDescription->width_ - 1
			);
	}
	if (!isPrinted)
		addCharToOutputBuffer(outputBufState, c);
}


static void
loadString(
		OutputBuffer *outputBufState,
		const char *strVal,
		SpecifierDescription *specifierDescription
    )
{
	char *dupVal;
	int length;

	length = strlen(strVal);

	/** make sure that we are not padding with zeros **/
	specifierDescription->outFlags_ &= ~(OFLAG_PAD_ZERO);

	/** see whether we have to limit the precision **/
	if ((specifierDescription->outFlags_ & OFLAG_HAS_PREC) &&
				(specifierDescription->precision_ < length))
	{
		dupVal = ckstrdup(strVal);

		dupVal[specifierDescription->precision_] = '\0';

		loadFromBuffer(outputBufState, dupVal,
						specifierDescription->precision_,
						specifierDescription);
		ckfree(dupVal);

	} else
	{
		loadFromBuffer(
				outputBufState,
				strVal,
				length,
				specifierDescription
			);
	}
}

static void loadBad(OutputBuffer *outputBufState)
{
	addStringToOutputBuffer(outputBufState, "<BAD>");
}

/**
 * print into this string using a "printf()" like format,
 * growing the buffer as we proceed.
 */
int tlSrString::vsprintf(const char *formatString, va_list args)
{
	OutputBuffer outputBufState;
	SpecifierDescription specifierDescription;
	int		specifierLength;
	int nConverted = 0;

	/** clear the output buffer */
	memset(&outputBufState, 0, sizeof(OutputBuffer));

	while (*formatString != '\0')
	{
		if (*formatString != '%')
		{
			addCharToOutputBuffer(&outputBufState, *formatString++);
		} else
		{

			/** read the formatString specifier **/
			specifierLength = parseFormatSpecifier(
						++formatString, &specifierDescription
					);

			if (specifierDescription.outFlags_ == OFLAG_BAD_FORMAT)
			{
				loadBad(&outputBufState);
				return (nConverted);
			}

			/** handle '*' in width spec **/
			if (specifierDescription.outFlags_ & OFLAG_WIDTH_LOADED)
			{
				specifierDescription.width_ = va_arg(args, int);
			}

			/** handle '*' in precision spec **/
			if (specifierDescription.outFlags_ & OFLAG_PREC_LOADED)
			{
				specifierDescription.precision_ = va_arg(args, int);
			}


			/** determine what data type to load for printing **/
			if (specifierDescription.frmtType_ == FORMAT_TYPE_PERCENT)
			{
				loadChar(&outputBufState, '%', &specifierDescription);


			} else switch (specifierDescription.dataType_)
			{
			case		DTYPE_INTEGER:
				{
					int iVal = va_arg(args, int);
					loadInteger(&outputBufState,
									iVal, &specifierDescription);
				}
				break;

			case		DTYPE_UNSIGNED:
				{
					unsigned uVal = va_arg(args, int);
					loadUnsigned(&outputBufState,
									uVal, &specifierDescription);
				}
				break;

			case		DTYPE_DOUBLE:
				{
					double dVal = va_arg(args, double);
					loadDouble(&outputBufState,
									dVal, &specifierDescription);
				}
				break;

			case		DTYPE_CHAR:
				{
					char cVal = (char) va_arg(args, int);
					loadChar(&outputBufState,
									cVal, &specifierDescription);
				}
				break;

			case		DTYPE_STRING:
				{
					/** get a char * off of the stack **/
					const char *strVal;
					strVal = va_arg(args, char *);
					if (strVal == NULL)
						strVal = "(nil)";
					loadString(&outputBufState,
									strVal, &specifierDescription);
				}
				break;

			case		DTYPE_TL_STRING:
				{
					const char *strVal;
					tlSrString *tlStrVal;

					/** get a tlSrString * off of the stack **/
					tlStrVal = va_arg(args, tlSrString *);
					if (tlStrVal == NULL)
					{
						strVal = "(nil)";
					} else
					{
						strVal = tlStrVal->getValue();
						if (strVal == NULL)
						{
							strVal = "(nil-tstring)";
						}
					}
					loadString(&outputBufState,
									strVal, &specifierDescription);
				}
				break;

