andrewhw/emgsim/c++/src/tlSrString.cpp
			case		DTYPE_POINTER:
				{
					void *pVal = va_arg(args, void *);
					specifierDescription.frmtType_ = FORMAT_TYPE_HEX;
					specifierDescription.outFlags_ |= OFLAG_PAD_ZERO;
					if (specifierDescription.width_ < 8)
					{
						specifierDescription.width_ = 8;
					}
					loadUnsigned(&outputBufState,
									(unsigned long) pVal,
									&specifierDescription);
				}
				break;
			}

			formatString += specifierLength;
			nConverted++;
		}
	}

	/** save in _our_ internal buffer, free buffer from OutputBuffer **/
	setValue( outputBufState.buffer_ );
	ckfree(outputBufState.buffer_);
	memset(&outputBufState, 0, sizeof(OutputBuffer));

	return (nConverted);
}

int tlSrString::sprintf(const char *formatString, ...)
{
	va_list args;
	int retval;

	va_start(args, formatString);
	retval = tlSrString::vsprintf(formatString, args);
	va_end(args);

	return(retval);
}

tlSrString tlSrString::niceDouble(double d)
{
	// need :: to ensure that we don't recursively call ourselves,
	// but rather actually call the function by this name
	setValue(::niceDouble(d));
	return *this;
}

tlSrString tlSrString::fullyTrimmedDouble(double d)
{
	setValue(::fullyTrimmedDouble(d));
	return *this;
}

void tlSrString::setQuoted(const char *s)
{
	char *tmp;
	int len;
	int tmpIndex;
	int start, end;
	int i, ch;

	len = strlen(s);

	tmpIndex = 0;
	tmp = (char *) ckalloc(len + 1);
	MSG_ASSERT(tmp != NULL, "malloc failed");

	if (s[0] == '"' && s[len-1] == '"')
	{
		start = 1;
		end = len-1;
	} else
	{
		start = 0;
		end = len;
	}

	for (i = start; i < end; i++)
	{
		ch = s[i++];
		if (ch == '\\')
		{
			if (isdigit(ch))
			{

				int k = 0;
				int octalVal = (ch - '0');

				while (k++ < 3)
				{
					ch = s[i++];
					if ( ! isdigit(ch))
					{
						break;
					}
					octalVal = (octalVal * 8 ) + (ch - '0');
				}
				tmp[tmpIndex++] = octalVal;

			} else
			{
				switch (ch)
				{
					case 'n':  tmp[tmpIndex++] = '\n'; break;
					case 't':  tmp[tmpIndex++] = '\t'; break;
					case 'b':  tmp[tmpIndex++] = '\b'; break;
					case 'r':  tmp[tmpIndex++] = '\r'; break;
					case 'f':  tmp[tmpIndex++] = '\f'; break;

					/** handle end of string semi-gracefully */
					case 0: 
						   tmp[tmpIndex++] = 0;
						   i--;
						   break;

					default: tmp[tmpIndex++] = ch;
				}
			}
		} else
		{
			tmp[tmpIndex++] = ch;
		}
	}
	tmp[tmpIndex++] = 0;

	setValue(tmp);
	ckfree(tmp);
}

void tlSrString::setQuoted(tlSrString s)
{
	tlSrString::setQuoted(s.getValue());
}

tlSrString tlSrString::getQuoted() const
{
	tlSrString r;
	char *tmp;
	int i, j;

	tmp = (char *) ckalloc( (getLength() * 2) + 3);
	MSG_ASSERT(tmp != NULL, "Out of memory");

	j = 0;
	tmp[j++] = '"';
	for (i = 0; i < getLength(); i++)
	{
		switch(data_->s_[i])
		{
		case '\n':
			tmp[j++] = '\\';
			tmp[j++] = 'n';
			break;

		case '\t':
			tmp[j++] = '\\';
			tmp[j++] = 't';
			break;

		case '\b':
			tmp[j++] = '\\';
			tmp[j++] = 'b';
			break;

		case '\v':
			tmp[j++] = '\\';
			tmp[j++] = 'v';
			break;

		case '\a':
			tmp[j++] = '\\';
			tmp[j++] = 'a';
			break;

		case '\\':
			tmp[j++] = '\\';
			tmp[j++] = '\\';
			break;

		case '"':
			tmp[j++] = '\\';
			tmp[j++] = '"';
			break;

		default:
			tmp[j++] = data_->s_[i];
		}
	}
	tmp[j++] = '"';
	tmp[j] = 0;

	r.setValue(tmp);
	ckfree(tmp);

	return r;
}

tlSrString tlSrString::toLower() const
{
	tlSrString r;
	char *s;
	int i;

	s = ckstrdup(getValue());
	for (i = 0; i < data_->sLen_; i++)
	{
		s[i] = tolower(s[i]);
	}

	r = s;

	ckfree(s);

	return r;
}

tlSrString tlSrString::toUpper() const
{
	tlSrString r;
	char *s;
	int i;

	s = ckstrdup(getValue());
	for (i = 0; i < data_->sLen_; i++)
	{
		s[i] = toupper(s[i]);
	}

	r = s;

	ckfree(s);

	return r;
}

int tlSrString::contains(const char *substring) const
{
	const char *m;

	if (data_ == NULL)
		return -1;
	m = strstr(data_->s_, substring);
	if (m == NULL)
		return -1;

	return (int) (m - data_->s_);
}

int tlSrString::contains(char match) const
{
	const char *m;

	if (data_ == NULL)
		return -1;
	m = strchr(data_->s_, match);
	if (m == NULL)
		return -1;

	return (int) (m - data_->s_);
}

int tlSrString::containsAny(const char *match) const
{
	const char *m, *matchChar;

	if (data_ == NULL)
		return -1;
	matchChar = match;
	while (*matchChar != 0)
	{
		m = strchr(data_->s_, *matchChar);
		if (m != NULL)
			return (int) (m - data_->s_);
		matchChar++;
	}

	return -1;
}

